// src/components/Home.js
import React from 'react';
import { Link } from 'react-router-dom';

function Home() {
  return (
    <div>
      <h2>Добре дошли във "Фитнес Онлайн Теодор"</h2>
      <p>Това приложение ще ви помогне да следите и организирате тренировките си. Можете да добавяте тренировки, като попълните името, описанието и продължителността на всяка тренировка.</p>
      <p>Започнете, като добавите първата си тренировка, или разгледайте списъка с текущи тренировки.</p>
      <div>
        <Link to="/add">
          <button>Добави Нова Тренировка</button>
        </Link>
      </div>
    </div>
  );
}

export default Home;
